# EA_DataAccGetBool

## Description
Returns boolean value from the object, associated to the accessory index.

```pascal
FUNCTION EA_DataAccGetBool(
				acc        : INTEGER;
				valueIndex : INTEGER): BOOLEAN;
```

```python
def vs.EA_DataAccGetBool(acc, valueIndex):
    return BOOLEAN
```

## Parameters
|Name|Type|Description|
|---|---|---|
|acc|INTEGER|   |
|valueIndex|INTEGER|   |

## Version
Availability: from Vectorworks 2016

## Category
* EnergyAnalysis Interface Library